# Lab 2 9/7/23

## 5. Apply + Lambda

We can determine which letters of the alphabet are not in any state's name using `DataFrame.apply` with an appropriate `lambda` function.

In [6]:
import pandas as pd
from string import ascii_lowercase

states = pd.read_csv('states.csv')

character_sets = states.State.apply(lambda name: set(name.lower()).intersection(ascii_lowercase))
character_sets

0                                {l, m, b, a}
1                                {k, l, s, a}
2                          {r, n, z, i, a, o}
3                             {r, s, n, a, k}
4                    {r, n, c, l, f, o, i, a}
5                          {r, d, c, l, a, o}
6                       {u, n, t, c, e, i, o}
7                          {r, w, d, e, l, a}
8     {b, u, r, s, m, t, d, c, l, f, o, i, a}
9                       {r, d, l, f, o, i, a}
10                         {g, r, e, i, a, o}
11                               {h, w, a, i}
12                            {h, d, i, a, o}
13                            {s, n, l, i, o}
14                               {n, i, a, d}
15                               {o, w, a, i}
16                               {k, s, n, a}
17                      {u, n, t, c, e, k, y}
18                      {u, s, n, l, i, a, o}
19                            {m, n, e, i, a}
20                      {r, m, n, d, l, a, y}
21                   {u, s, m, h, t, c, e, a}
22                      {g, m, n, h, c, i, a}
23                   {s, m, n, t, e, o, i, a}
24                               {m, p, s, i}
25                         {u, r, s, m, i, o}
26                            {m, n, t, a, o}
27                      {b, r, s, n, e, a, k}
28                            {n, d, e, v, a}
29             {r, s, w, m, n, h, e, p, i, a}
30                      {r, s, w, n, e, j, y}
31                   {w, x, m, n, c, e, i, o}
32                      {r, w, n, e, k, o, y}
33                {r, n, h, t, c, l, o, i, a}
34                   {r, n, h, d, t, o, a, k}
35                                  {o, h, i}
36                         {m, h, l, o, a, k}
37                            {g, r, n, e, o}
38                {s, n, e, l, v, p, i, a, y}
39             {r, s, n, h, d, e, l, o, i, a}
40          {u, r, s, n, h, t, c, l, o, i, a}
41                   {u, s, h, d, t, o, a, k}
42                               {e, t, n, s}
43                            {s, x, t, e, a}
44                               {u, h, a, t}
45                      {r, m, n, t, e, v, o}
46                         {g, r, n, v, i, a}
47                {g, w, s, n, h, t, o, i, a}
48             {g, r, s, w, n, t, e, v, i, a}
49                         {w, s, n, c, i, o}
50                      {g, w, m, n, i, o, y}
51                   {u, r, t, c, e, p, i, o}
Name: State, dtype: object

In [7]:
from functools import reduce
character_set = reduce(lambda x, y: x.union(y), character_sets)
character_set

{'a',
 'b',
 'c',
 'd',
 'e',
 'f',
 'g',
 'h',
 'i',
 'j',
 'k',
 'l',
 'm',
 'n',
 'o',
 'p',
 'r',
 's',
 't',
 'u',
 'v',
 'w',
 'x',
 'y',
 'z'}

In [8]:
set(ascii_lowercase).difference(character_set)

{'q'}

## Built-in Methods and Axis

In [10]:
states = pd.read_csv('states.csv', index_col=0)
states.head()

            Population (2016)  Population (2017)
State
Alabama               4860545            4874747
Alaska                 741522             739795
Arizona               6908642            7016270
Arkansas              2988231            3004279
California           39296476           39536653

In [11]:
states.mean(axis=0)  # mean along row axis (so, per column mean)

Population (2016)    6.284855e+06
Population (2017)    6.328007e+06
dtype: float64

In [12]:
states.mean(axis=1)  # mean along column axis (so, per row mean)

State
Alabama                  4867646.0
Alaska                    740658.5
Arizona                  6962456.0
Arkansas                 2996255.0
California              39416564.5
Colorado                 5568629.5
Connecticut              3587934.5
Delaware                  957318.5
District of Columbia      689154.0
Florida                 20820494.5
Georgia                 10371499.5
Hawaii                   1428110.5
Idaho                    1698484.5
Illinois                12818874.5
Indiana                  6650412.5
Iowa                     3138290.0
Kansas                   2910427.0
Kentucky                 4445151.0
Louisiana                4685245.0
Maine                    1333069.5
Maryland                 6038464.5
Massachusetts            6841770.0
Michigan                 9947878.0
Minnesota                5550828.0
Mississippi              2984757.5
Missouri                 6102354.0
Montana                  1044574.5
Nebraska                 1913839.5
Nevada                   2968646.5
New Hampshire            1338905.0
New Jersey               8992030.0
New Mexico               2086751.0
New York                19842842.5
North Carolina          10215054.0
North Dakota              755470.5
Ohio                    11640581.5
Oklahoma                 3926035.5
Oregon                   4114382.5
Pennsylvania            12796311.0
Rhode Island             1058602.5
South Carolina           4992095.5
South Dakota              865604.0
Tennessee                6682694.0
Texas                   28104729.0
Utah                     3073077.0
Vermont                   623505.5
Virginia                 8442200.0
Washington               7343338.5
West Virginia            1822247.0
Wisconsin                5784200.0
Wyoming                   582112.5
Puerto Rico              3371848.5
dtype: float64

In [15]:
states.mean(axis=0).mean()  # first get mean along rows, then get mean of this to get mean of entire DataFrame

6306430.865384616

## 7. Writing Files

Convert `.csv` to `.bsv` (bar-separated value).

In [17]:
states = pd.read_csv('states.csv', index_col=0)
states.to_csv('intro.bsv', sep='|')

## 8. Combining `DataFrame`s

### 8.1 Merging

Perform an inner join

In [19]:
left = pd.DataFrame(dict(id=[1, 2, 3], names=['Ethan', 'Henry', 'Mason']))
left

   id  names
0   1  Ethan
1   2  Henry
2   3  Mason

In [21]:
right = pd.DataFrame(dict(id=[1, 2, 3], names=['Mark', 'Luke', 'Peter']))
right

   id  names
0   1   Mark
1   2   Luke
2   3  Peter

In [22]:
pd.merge(left, right, on='id')

   id names_x names_y
0   1   Ethan    Mark
1   2   Henry    Luke
2   3   Mason   Peter

Inner join only keeps common elements

In [25]:
left = pd.DataFrame(dict(id=[1, 3], names=['Ethan', 'Mason']))
right = pd.DataFrame(dict(id=[1, 2], names=['Mark', 'Luke']))
pd.merge(left, right, on='id')

   id names_x names_y
0   1   Ethan    Mark

Left join keeps all elements in left `DataFrame`

In [26]:
pd.merge(left, right, on='id', how='left')

   id names_x names_y
0   1   Ethan    Mark
1   3   Mason     NaN

Right join keeps all elements in right `DataFrame`

In [27]:
pd.merge(left, right, on='id', how='right')

   id names_x names_y
0   1   Ethan    Mark
1   2     NaN    Luke

Outer join keeps all elements from both `DataFrames`

In [28]:
pd.merge(left, right, on='id', how='outer')

   id names_x names_y
0   1   Ethan    Mark
1   3   Mason     NaN
2   2     NaN    Luke

### 8.2 Concatenating

In [29]:
top = pd.DataFrame(dict(letters=list('abc'), numbers=[1, 2, 3]))
bottom = pd.DataFrame(dict(letters=list('ghi'), numbers=[7, 8, 9]))
pd.concat([top, bottom])

  letters  numbers
0       a        1
1       b        2
2       c        3
0       g        7
1       h        8
2       i        9

In [30]:
top = pd.DataFrame(dict(letters=list('abc'), numbers=[1, 2, 3]))
mid = pd.DataFrame(dict(letters=list('def'), numbers=[4, 5, 6]))
bot = pd.DataFrame(dict(letters=list('ghi'), numbers=[7, 8, 9]))

In [31]:
pd.merge(top, mid, on='numbers', how='outer')

  letters_x  numbers letters_y
0         a        1       NaN
1         b        2       NaN
2         c        3       NaN
3       NaN        4         d
4       NaN        5         e
5       NaN        6         f

If we do an inner join on `numbers`, then there will be no elements left.

In [32]:
pd.merge(top, mid, on='numbers')

Empty DataFrame
Columns: [letters_x, numbers, letters_y]
Index: []

In [33]:
pd.concat([top, mid, bot])

  letters  numbers
0       a        1
1       b        2
2       c        3
0       d        4
1       e        5
2       f        6
0       g        7
1       h        8
2       i        9

## 9. Reshaping `DataFrame`s

### 9.1 Grouping Data